'''

网编
    概念
        osi 7层模型 / 5层模型/各层协议 /物理设备
        tcp 三次握手 四次挥手


    代码
        tcp-socket
            粘包现象
        udp-socket
        tcp-socketsever
            粘包现象
    解决粘包问题的上传大文件
        recv(n)并不表示一个能接收到的n

    验证客户端的合法性
        什么场景 -> 一定是在公司内部，无用户的情况下（没人能看得见我们的client端代码的时候)
        有人的情况下，就直接做登录就可以
    并发的socketserver tcp 协议的server端
        把模板背下来
        把其它的逻辑移植到handle方法里

    作业：ftp
        三次登录
        员工信息表  字符串 文件 逻辑能力
        计算器     函数和循环
        选课系统    面向对象 反射
        网盘ftp     网络编程 + 上面所有







'''